---
kind: type
id: T:Autodesk.Revit.DB.ExportLayerTableIterator
source: html/24174426-8fd0-a24c-8ee0-1d32532e6f77.htm
---
# Autodesk.Revit.DB.ExportLayerTableIterator

An iterator to a set of Layer table.

## Syntax (C#)
```csharp
public class ExportLayerTableIterator : IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
```